<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35f5b7ddc71375b7564c3d5aa02c78face05001ea31bbf23fb0bba810c9a0bcc","plan_job_ref":"Job Plan Airflow DAGs #350 at https://github.com/cal-itp/data-infra/actions/runs/16377019001","plan_out_hash":"1561342a8323589451fc27424a7cbe2213d8a68398dc80961f48e6d1f88fde7e","plan_hash":"06f428003c51a4dc2d324b329a5e7ae0ac8fbceba0de620ccfe1d8ce3736ccac","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 18 to change, 9 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "XmWZkA==" -> (known after apply)
!~      detect_md5hash      = "jABgKMAYxVm+czmukHiiKw==" -> "different hash"
!~      generation          = 1752855618467062 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jABgKMAYxVm+czmukHiiKw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_upt.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YuPhvQ==" -> (known after apply)
!~      detect_md5hash      = "T6TJzXhZ6c6tcHZmDjkR4w==" -> "different hash"
!~      generation          = 1749663115817396 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_upt.sql"
!~      md5hash             = "T6TJzXhZ6c6tcHZmDjkR4w==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_upt.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_voms.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "rwWqvA==" -> (known after apply)
!~      detect_md5hash      = "SM+D+Y4gktTzonSHafRAqA==" -> "different hash"
!~      generation          = 1749663115208216 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_voms.sql"
!~      md5hash             = "SM+D+Y4gktTzonSHafRAqA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_voms.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrh.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "LDBjrQ==" -> (known after apply)
!~      detect_md5hash      = "Q46Di+WcPytCJo+obwDj3w==" -> "different hash"
!~      generation          = 1749663113618421 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrh.sql"
!~      md5hash             = "Q46Di+WcPytCJo+obwDj3w==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrh.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrm.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "tOgjwQ==" -> (known after apply)
!~      detect_md5hash      = "OdthO8XrZW9FQTysnwealw==" -> "different hash"
!~      generation          = 1749663121285673 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrm.sql"
!~      md5hash             = "OdthO8XrZW9FQTysnwealw==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/ntd/int_ntd__monthly_ridership_with_adjustments_vrm.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd/dim_annual_agency_information.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "GCAFOA==" -> (known after apply)
!~      detect_md5hash      = "/mTcsnaqkTrWPW/HSCEX8Q==" -> "different hash"
!~      generation          = 1749663116715228 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd/dim_annual_agency_information.sql"
!~      md5hash             = "/mTcsnaqkTrWPW/HSCEX8Q==" -> (known after apply)
        name                = "data/warehouse/models/mart/ntd/dim_annual_agency_information.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd/dim_monthly_ridership_with_adjustments.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "8axD6Q==" -> (known after apply)
!~      detect_md5hash      = "4LJK6HNKut3HcTpfuQq9Mw==" -> "different hash"
!~      generation          = 1749663121104100 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql"
!~      md5hash             = "4LJK6HNKut3HcTpfuQq9Mw==" -> (known after apply)
        name                = "data/warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/_mart_ntd_ridership.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "vauNXQ==" -> (known after apply)
!~      detect_md5hash      = "FnrrmGlVa+hxmrTEp6+t/w==" -> "different hash"
!~      generation          = 1749663121288133 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/_mart_ntd_ridership.yml"
!~      md5hash             = "FnrrmGlVa+hxmrTEp6+t/w==" -> (known after apply)
        name                = "data/warehouse/models/mart/ntd_ridership/_mart_ntd_ridership.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "ZGy1EQ==" -> null
-       detect_md5hash      = "wbxIjY/k6eueBc3XuzmBNg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663118200390 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       md5hash             = "wbxIjY/k6eueBc3XuzmBNg==" -> null
-       md5hexhash          = "c1bc488d8fe4e9eb9e05cdd7bb398136" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql?generation=1749663118200390&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "shpfAg==" -> null
-       detect_md5hash      = "7XLnWh5Ih8ZHck9CDyJQVg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663118661779 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       md5hash             = "7XLnWh5Ih8ZHck9CDyJQVg==" -> null
-       md5hexhash          = "ed72e75a1e4887c647724f420f225056" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql?generation=1749663118661779&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "OUDGew==" -> null
-       detect_md5hash      = "I8Lkjcemze7liHIVcaMEKQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663112318469 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       md5hash             = "I8Lkjcemze7liHIVcaMEKQ==" -> null
-       md5hexhash          = "23c2e48dc7a6cdeee588721571a30429" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql?generation=1749663112318469&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "4nyh/A==" -> null
-       detect_md5hash      = "Hc2ykZfyT9/AGWbBZNDq6A==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663117993802 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       md5hash             = "Hc2ykZfyT9/AGWbBZNDq6A==" -> null
-       md5hexhash          = "1dcdb29197f24fdfc01966c164d0eae8" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql?generation=1749663117993802&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "gKsXYg==" -> null
-       detect_md5hash      = "/Nsqs/s5LgKiVuW0Dxl6cw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663117669353 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       md5hash             = "/Nsqs/s5LgKiVuW0Dxl6cw==" -> null
-       md5hexhash          = "fcdb2ab3fb392e02a256e5b40f197a73" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql?generation=1749663117669353&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "NpzGHA==" -> null
-       detect_md5hash      = "5ca5C7bceJvi5UEumz/kCA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663115994949 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       md5hash             = "5ca5C7bceJvi5UEumz/kCA==" -> null
-       md5hexhash          = "e5c6b90bb6dc789be2e5412e9b3fe408" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql?generation=1749663115994949&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "3VyUvw==" -> null
-       detect_md5hash      = "VPh+cvIDJQpf0dmlYViMBQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663120296103 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       md5hash             = "VPh+cvIDJQpf0dmlYViMBQ==" -> null
-       md5hexhash          = "54f87e72f203250a5fd1d9a561588c05" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql?generation=1749663120296103&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "RwZ1SQ==" -> null
-       detect_md5hash      = "CZPoozmsKRg7lNftU8dekA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663118497638 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       md5hash             = "CZPoozmsKRg7lNftU8dekA==" -> null
-       md5hexhash          = "0993e8a339ac29183b94d7ed53c75e90" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql?generation=1749663118497638&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "+JOZsg==" -> null
-       detect_md5hash      = "rawLwrhKQGPd32yUL0Z1Fw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1749663116964455 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       md5hash             = "rawLwrhKQGPd32yUL0Z1Fw==" -> null
-       md5hexhash          = "adac0bc2b84a4063dddf6c942f467517" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql?generation=1749663116964455&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/ntd_ridership/fct_monthly_ridership_with_adjustments.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/ntd_ridership/fct_monthly_ridership_with_adjustments.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/ntd_ridership/fct_monthly_ridership_with_adjustments.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "pnJRmA==" -> (known after apply)
!~      detect_md5hash      = "ME4V8bzaV2WX6rbxGkvVaA==" -> "different hash"
!~      generation          = 1752622236935518 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"
!~      md5hash             = "ME4V8bzaV2WX6rbxGkvVaA==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "VHLciA==" -> (known after apply)
!~      detect_md5hash      = "flAZRqxWJj+Ez7DioKBnXA==" -> "different hash"
!~      generation          = 1752622237818877 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"
!~      md5hash             = "flAZRqxWJj+Ez7DioKBnXA==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "tDDetg==" -> (known after apply)
!~      detect_md5hash      = "TsNwblh/7QT+RuQSEp2UVw==" -> "different hash"
!~      generation          = 1752622238293921 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"
!~      md5hash             = "TsNwblh/7QT+RuQSEp2UVw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "e5FrIA==" -> (known after apply)
!~      detect_md5hash      = "QisdMhWhSrExFUd7MsDnrw==" -> "different hash"
!~      generation          = 1752622237623591 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"
!~      md5hash             = "QisdMhWhSrExFUd7MsDnrw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "OevwOA==" -> (known after apply)
!~      detect_md5hash      = "smrstDSDHVAfIcfQlawZ8g==" -> "different hash"
!~      generation          = 1752622237092298 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"
!~      md5hash             = "smrstDSDHVAfIcfQlawZ8g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "TsqDzg==" -> (known after apply)
!~      detect_md5hash      = "BUDkHW0CX2uqeql/JydDxQ==" -> "different hash"
!~      generation          = 1752622237816276 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"
!~      md5hash             = "BUDkHW0CX2uqeql/JydDxQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "U+Nxnw==" -> (known after apply)
!~      detect_md5hash      = "v6WWufiuw6I6nwJ8ea3/3g==" -> "different hash"
!~      generation          = 1752622237822342 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"
!~      md5hash             = "v6WWufiuw6I6nwJ8ea3/3g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "HeQdug==" -> (known after apply)
!~      detect_md5hash      = "anF7mdEw+HnZ7cF0lGMldQ==" -> "different hash"
!~      generation          = 1752622238111167 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"
!~      md5hash             = "anF7mdEw+HnZ7cF0lGMldQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "IkHt/A==" -> (known after apply)
!~      detect_md5hash      = "kOmymouK47O0fQVVSn5+8g==" -> "different hash"
!~      generation          = 1752622237805416 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"
!~      md5hash             = "kOmymouK47O0fQVVSn5+8g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "24GPXw==" -> (known after apply)
!~      detect_md5hash      = "R11VD+ssi9yD0q3zetVRwg==" -> "different hash"
!~      generation          = 1752855620512942 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "R11VD+ssi9yD0q3zetVRwg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 18 to change, 9 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #350](https://github.com/cal-itp/data-infra/actions/runs/16377019001)